[
  {
    "date": "2025-12-21",
    "title": "Weekly Maintenance & System Stabilization",
    "body": "Performed a scheduled water change as part of ongoing post-BBA stabilization. Pre-water-change nitrate levels measured approximately 10–20 ppm, remaining within the target range. Drained roughly 90% of the sump and about 80% of the display. Completed a moderate plant trimming, focusing on overall shape and removing older growth. Replaced one filter sponge as part of routine filter upkeep. Dosed Prime during refill and added Stability to support beneficial bacteria after introducing new filter media. System remains stable following the end of Excel treatment with attention on balanced nutrients and steady biological filtration.",
    "category": "Weekly Recap",
    "quick_facts": "Nitrate 10–20 ppm; ~90% sump / ~80% display WC; Prime + Stability after sponge swap",
    "nitrate_ppm": "10-20"
  },
  {
    "date": "2025-12-15",
    "title": "Weekly Recap & Maintenance",
    "body": "Performed the weekly water change with roughly 90% drained from the sump and 75% from the display. Pre–water change nitrate measured around 20 ppm. Lost one Celestial Pearl Danio from the newest group (age at purchase unknown). Completed light moss trimming in the display and moved trimmings to the refugium. Finished with a standard cap dose of Seachem Excel. Overall system remains stable.",
    "category": "Weekly Recap",
    "quick_facts": "Nitrate ~20 ppm; ~90% sump / ~75% display WC; Excel cap dose",
    "nitrate_ppm": "20"
  },
  {
    "date": "2025-12-08",
    "title": "December 2025 Weekly Recaps Begin",
    "body": "Completed December's first water change on December 7, 2025 and launched the weekly recap cycle. Recaps will now track nitrates and key parameters, plant health and growth, BBA control spot-checks, and any livestock observations. Tank stable at 5 ppm nitrates with BBA nearly eliminated; all fish healthy with bright colors. December logs will focus on confirming long-term stability after BBA control.",
    "category": "Weekly Recap",
    "quick_facts": "Recaps live; nitrates 5 ppm; BBA nearly gone",
    "nitrate_ppm": "5"
  },
  {
    "date": "2025-12-08",
    "title": "Post-Water-Change Weekly Recap",
    "body": "Conducted the first weekly check-in after the December 7 water change. Nitrate held steady around 5–10 ppm, and fish showed strong appetite with flakes and bloodworms. Plants are pushing fresh growth where older leaves were trimmed back, and the sump sponge rinse kept flow unchanged. Dosed a maintenance cap of Seachem Excel; no additional water change needed today.",
    "category": "Maintenance",
    "quick_facts": "Nitrate 5–10 ppm; Excel maintenance dose; strong feeding response",
    "nitrate_ppm": "5-10"
  },
  {
    "date": "2025-12-07",
    "title": "Maintenance & Livestock Update",
    "body": "Pre–water change nitrate reading came in at 10 ppm. Performed a large water change: ~75% from the display tank and ~90% from the sump. One red cherry barb was lost today — part of the original aging group. Rinsed the sponge filters in tank water since replacements are currently unavailable (biofilm preserved). Light equipment wipe-down completed; no real algae present aside from a small amount of diatoms. System remains stable.",
    "category": "Maintenance",
    "quick_facts": "",
    "nitrate_ppm": "10"
  }
]
