[
  {
    "date": "2025-11-02",
    "time": "",
    "category": "Maintenance & Dosing",
    "quick_facts": "Pre-water-change nitrate test: 20–40 ppm (≈20) · ~95% sump / ~70% display water change + light trim · Spot- and cap-dosed Seachem Excel (post-change)",
    "ramble": "Continuing Post-Treatment Recovery Week. Noticed new plant growth emerging.",
    "nitrate_ppm": "",
    "nitrite_ppm": "",
    "ammonia_ppm": "",
    "ph": "",
    "media": "",
    "tags": "29g,dosing,maintenance"
  },
  {
    "date": "2025-11-03",
    "time": "",
    "category": "Feeding, Dosing & Observation",
    "quick_facts": "Fed flakes and brine shrimp · Excel spot-dose x2 · ThrivePlus 0 · No water change",
    "ramble": "Malaysian trumpet snails were observed naturally cleaning the sump overflow screen, preventing buildup — marking the “Natural Balance Discovery” milestone as the system begins showing signs of self-regulation during the Post-Treatment Recovery Week.",
    "nitrate_ppm": "",
    "nitrite_ppm": "",
    "ammonia_ppm": "",
    "ph": "",
    "media": "assets/images/mts-on-strainer-2025-11-03.jpg",
    "tags": "29g,dosing,feeding,natural-balance-discovery,observation,post-treatment-recovery-week"
  },
  {
    "date": "2025-11-04",
    "time": "",
    "category": "Feeding, Test & Dosing",
    "quick_facts": "Nitrate <5 ppm · Fed algae wafers + flakes · 4 pumps NilocG Thrive Plus · Spot-dosed Seachem Excel",
    "ramble": "Nitrate tested under 5 ppm. Dosed 4 pumps of NilocG Thrive Plus and spot-dosed Seachem Excel. Fed algae wafers and a small amount of flakes to ensure all fish fed. Nutrient levels remain very low but stable as Post-Treatment Recovery Week continues.",
    "nitrate_ppm": "<5",
    "nitrite_ppm": "",
    "ammonia_ppm": "",
    "ph": "",
    "media": "",
    "tags": "29g,feeding,dosing,testing,post-treatment-recovery-week"
  },
  {
    "date": "2025-11-05",
    "time": "",
    "category": "Feeding & Dosing",
    "quick_facts": "Fed flakes + bloodworms · Spot-dosed Seachem Excel · No water change",
    "ramble": "Fed flakes and bloodworms. Spot-dosed Seachem Excel for light algae control. Fish feeding response strong; system remains stable through Post-Treatment Recovery Week.",
    "nitrate_ppm": "",
    "nitrite_ppm": "",
    "ammonia_ppm": "",
    "ph": "",
    "media": "",
    "tags": "29g,feeding,dosing,post-treatment-recovery-week"
  },
  {
    "date": "2025-11-06",
    "time": "",
    "category": "Feeding, Test & Dosing",
    "quick_facts": "Nitrate 20 ppm · Fed flakes + brine shrimp · Spot-dosed Seachem Excel",
    "ramble": "Nitrate measured at 20 ppm. Fed flakes and brine shrimp. Spot-dosed Seachem Excel. The BBA that was near the random flow generator is now completely gone — marking the completion of the Post-Treatment Recovery Week and the successful end of the recovery cycle.",
    "nitrate_ppm": "20",
    "nitrite_ppm": "",
    "ammonia_ppm": "",
    "ph": "",
    "media": "",
    "tags": "29g,feeding,dosing,testing,post-treatment-recovery-week"
  },
  {
    "date": "2025-11-09",
    "time": "",
    "category": "Maintenance",
    "quick_facts": "Nitrate 40 ppm (pre-water-change) · ~90% sump / ~75% display water change · New poly-fil barrier installed",
    "ramble": "Pre-water-change nitrate test measured at 40 ppm. Performed ~90% sump and ~75% display water change. Added a new poly-fil barrier to prevent debris from entering the pump chamber and support continued water clarity and flow stabilization.",
    "nitrate_ppm": "40",
    "nitrite_ppm": "",
    "ammonia_ppm": "",
    "ph": "",
    "media": "",
    "tags": "29g,maintenance,post-treatment-recovery-week",
    "photos": [
      {
        "src": "/assets/images/2025-11-09-sump-top-poly.jpg",
        "alt": "Top-down view of the sump after installing the new poly-fil barrier. Plants visible in the refugium section.",
        "caption": "Top view — new poly-fil layer added above the refugium for debris control."
      },
      {
        "src": "/assets/images/2025-11-09-sump-front-poly.jpg",
        "alt": "Front view showing the sump chambers with fresh poly-fil installed for mechanical filtration and flow clarity.",
        "caption": "Front view — poly-fil barrier placed to prevent debris from reaching the pump chamber."
      },
      {
        "src": "/assets/images/2025-11-09-sump-filled-poly.jpg",
        "alt": "Full sump setup showing all chambers after refill. Clear flow path and new filter media in place.",
        "caption": "System refilled — flow restored and water clarity improving post-maintenance."
      }
    ]
  },
  {
    "date": "2025-11-10",
    "title": "Feeding",
    "body": "Fed flakes and brine shrimp. Standard Monday feeding with healthy appetite observed. System remains stable following recent maintenance and filtration updates."
  },
  {
    "date": "2025-11-11",
    "title": "Feeding, Test & Dosing",
    "body": "Nitrate measured at 5 ppm. Fed algae wafers and flakes. Dosed Seachem Excel (1 capful) and NilocG Thrive Plus (4 pumps). Stable parameters maintained through consistent nutrient and plant care routine."
  },
  {
    "date": "2025-11-12",
    "title": "Feeding, Test & Dosing",
    "body": "Nitrate measured between 10–20 ppm (closer to 10). Fed flakes and bloodworms. Dosed one capful of Seachem Excel as part of the ongoing daily maintenance routine. Nutrient levels stable and fish behavior normal."
  },
  {
    "date": "2025-11-13",
    "title": "Feeding, Test, Dosing & Livestock Update",
    "body": "Nitrate remained between 10–20 ppm. Fed flakes and brine shrimp. Spot-dosed Seachem Excel for light algae control. Noted the loss of two long-time fish: the last of the original pencilfish (5+ years) and one original cherry barb of the same age. Losses appear age-related and consistent with natural lifespan."
  },
  {
    "date": "2025-11-17",
    "title": "Feeding, Test, Maintenance & Dosing",
    "body": "Fed flakes and brine shrimp. Nitrate tested around 40 ppm. Performed ~75% display and ~90% sump water change. Replaced Purigen and poly-fil, and removed excess poly-fil between the refugium and return pump to reduce flow restriction. Light plant trimming completed. Dosed Seachem Excel and Stability. Updated weekly fertilizer plan: switching to a single 4-pump Thrive dose this week instead of the usual 8-pump split routine."
  },
  {
    "date": "2025-11-18",
    "title": "Feeding",
    "body": "Fed algae wafers and flakes for veggie day. Fish responded well and feeding was consistent."
  },
  {
    "date": "2025-11-19",
    "title": "Feeding, Test & Dosing",
    "body": "Nitrate tested at 5 ppm. Fed flakes and bloodworms. Spot- and cap-dosed Seachem Excel. BBA nearly gone; only a small area remains in a sensitive plant zone, so treatment is applied carefully to avoid damaging plant tissue."
  },
  {
    "date": "2025-11-20",
    "title": "Feeding, Test & Dosing & Filtration Update",
    "body": "Feeding: Brine shrimp + flakes. Nitrates measured around 5 ppm (low range). Dosed 4 pumps of NilocG Thrive Plus fertilizer and skipped Seachem Excel to avoid stressing sensitive plants. Added a bag of Seachem Matrix to the filter chamber to weigh down floating filter pads, expand biomedia capacity, and support long-term beneficial bacteria stability. Tank remains stable with strong feeding response; fertilizer dose increased today due to the low nitrate reading.",
    "photos": [
      {
        "src": "/assets/images/filter-chamber-update-2025-11-20-matrix.jpg",
        "alt": "Filter chamber update on November 20, 2025 showing Seachem Matrix and poly-fil in the sump compartment",
        "caption": ""
      }
    ]
  }
]
