[
  {
    "date": "2026-02-16",
    "title": "Post-Incident Stabilization Water Change",
    "body": "Performed a follow-up stabilization water change. Sump: Drained as much as possible. Display: ~50–60% drain (experimenting with smaller display changes). Prime was properly dosed prior to refill. Last week included two water changes: 1. The initial large change where Prime was accidentally omitted. 2. A midweek corrective water change (Wednesday) to support recovery. Current livestock status: Remaining Cherry Barbs, Betta, Kuhli Loaches (when visible), Shrimp and snails. The visual density of the tank is noticeably reduced due to recent losses, but the system appears stable. No new signs of distress observed. Moving forward, experimenting with slightly smaller display water changes while maintaining heavy sump turnover. System focus: stability, bacterial support, and slow recovery.",
    "category": "Journal Update",
    "quick_facts": "Follow-up stabilization water change; heavy sump drain with reduced display drain; Prime dosed correctly prior to refill; no new distress observed; ongoing recovery and bacterial support focus",
    "nitrate_ppm": ""
  },
  {
    "date": "2026-02-10",
    "title": "Post-Maintenance Loss & System Stabilization",
    "body": "A difficult entry to write. Following a routine water change on February 9, 2026, Prime was accidentally not added during the refill. Within 24 hours, significant fish loss was observed. Losses included: All Cardinal Tetras (long-term residents, over 8 years) and multiple Panda Loaches. Upon discovery, deceased fish were removed immediately to prevent secondary water quality issues. Invertebrates (shrimp and snails) had already begun scavenging, indicating rapid onset following exposure. Prime was dosed as soon as the issue was identified. Feeding was reduced to very light amounts, and Stability will be added to support biological recovery. Additional monitoring and potential mid-week water changes are planned to maintain stable parameters. This event appears to be an acute water conditioning error, not a systemic or long-term husbandry issue.",
    "category": "Journal Update",
    "quick_facts": "Missed Prime dose during refill; acute livestock loss within 24 hours; immediate removal and corrective dosing; reduced feeding and Stability support; increased monitoring planned",
    "nitrate_ppm": ""
  }
]
